{"config": {"layers": [{"config": {"units": 32, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 4], "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "use_bias": true, "name": "dense_130", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 3, "trainable": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_131", "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_142"}, "keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow"}